`timescale 1ns/1ps

/*
    --------------------模块功能--------------------
    读取轮常数
    --------------------基本信息--------------------
    日期: 2025-07-31
    作者: ZJX
    --------------------端口描述--------------------
    i_r : 地址
    o_rc   : 轮常数
*/

module ReadRC(
    input  wire[4:0] i_r  ,
    output wire[6:0] o_rc  
);
    /*--------------- 参数定义 ---------------*/
    /*--------------- 变量定义 ---------------*/
    reg[6:0] rc;
    /*--------------- 打拍 ---------------*/
    /*--------------- 逻辑控制 ---------------*/
    always @(*) begin
        case (i_r)
            5'd24   : rc = 7'b0000001;
            5'd23   : rc = 7'b0011010;
            5'd22   : rc = 7'b1011110;
            5'd21   : rc = 7'b1110000;
            5'd20   : rc = 7'b0011111;
            5'd19   : rc = 7'b0100001;
            5'd18   : rc = 7'b1111001;
            5'd17   : rc = 7'b1010101;
            5'd16   : rc = 7'b0001110;
            5'd15   : rc = 7'b0001100;
            5'd14   : rc = 7'b0110101;
            5'd13   : rc = 7'b0100110;
            5'd12   : rc = 7'b0111111;
            5'd11   : rc = 7'b1001111;
            5'd10   : rc = 7'b1011101;
            5'd9    : rc = 7'b1010011;
            5'd8    : rc = 7'b1010010;
            5'd7    : rc = 7'b1001000;
            5'd6    : rc = 7'b0010110;
            5'd5    : rc = 7'b1100110;
            5'd4    : rc = 7'b1111001;
            5'd3    : rc = 7'b1011000;
            5'd2    : rc = 7'b0100001;
            5'd1    : rc = 7'b1110100;
            default : rc = 7'b0000000;
        endcase
    end
    // Output 
    assign o_rc = rc;
    /*--------------- 模块例化 ---------------*/
endmodule


/*
////==============原理解析——designed by TJY=========///
keccak-f【1600】共24轮，需要24个常数，地址由24递减到1，对应1-24轮；
每个轮常数只有7位有效，这7位再lota步骤中被嵌入到64位状态的最高位和特定位置（63，31，15，7，3，1，0）位
always@纯组合逻辑实现，综合后会变成24x7bit的ROM/LUT
密码学原理：24个常数是由LFSR生成的伪随机序列，用于打破对称性，每轮只异或7位到特定位置，这是lota步骤
*/